set LIB_FOLDER /ubc/ece/data/cmc2/kits/GPDK45/gsclib045_all_v4.4/gsclib045/timing
set SOURCE_FOLDER /ubc/ece/home/ugrads/s/sidsud03/Desktop/Genus/MAC
set_db lib_search_path [concat [get_db lib_search_path] $SOURCE_FOLDER $LIB_FOLDER ]
set_db library "slow_vdd1v0_basicCells.lib"

set TOP_LEVEL mkMACBuff
set MULTIPLIER multiplier
read_hdl -sv "./syn/${TOP_LEVEL}.sv ./syn/${MULTIPLIER}.sv"
elaborate $TOP_LEVEL
check_design -unresolved


source MAC_constraints.tcl 


synthesize -to_generic -effort medium
synthesize -to_mapped -effort medium -no_incr
synthesize -to_mapped -effort medium -incr
insert_tiehilo_cells

report_area > ./syn/reports/${TOP_LEVEL}_area.rpt
report_gates > ./syn/reports/${TOP_LEVEL}_gates.rpt
report_timing > ./syn/reports/${TOP_LEVEL}_timing.rpt
report_power > ./syn/reports/${TOP_LEVEL}_power.rpt
report_qor > ./syn/reports/${TOP_LEVEL}_qor.rpt

write_hdl -mapped > ./syn/outputs/${TOP_LEVEL}_map.sv 
write_sdc  > ./syn/outputs/${TOP_LEVEL}_map.sdc 
write_sdf > ./syn/outputs/${TOP_LEVEL}_map.sdf

write_db -to ./syn/chkpts/${TOP_LEVEL}_synth.dat
